#coding = utf-8
"""
p_6ce1_6cab_7d05_8336_5e97_v 0.1

1. p_8336_7a2e_v p_7d05_v p_7da0_v p_6e05_v p_62b9_v p_70cf_9f8d_v
2. p_914d_6599_v p_73cd_73e0_v p_7c89_5713_v p_767e_9999_v p_6ab8_6aac_v p_6885_5b50_v
3. p_7cd6_91cf_v p_5c11_7cd6_v 3/4, p_534a_7cd6_v 1/2 p_5fae_7cd6_v 1/4
4. p_51b0_91cf_v p_53bb_51b0_v p_5c11_51b0_v
"""

p_8336_7a2e_v = {"紅茶":15,"綠茶":15, "清茶":15, "抹茶":15, \
       "烏龍":15, "奶茶":20, "奶綠":20} #字典

p_914d_6599_v = {"珍珠":5, "粉圓":5, "百香":5, "檸檬":5, "梅子":5}

p_7cd6_91cf_v = ["少糖","半糖","微糖"] #列表

p_51b0_91cf_v = ["去冰", "少冰"]

def p_98f2_6599_55ae_751f_6210_5668_v():
    """
    p_7522_751f_98f2_6599_50f9_76ee_55ae_v
    """
    for p_6599_v in p_914d_6599_v.keys(): # 迴圈
        for p_8336_v in p_8336_7a2e_v.keys():
            p_6a19_50f9_v = p_8336_7a2e_v[p_8336_v] + p_914d_6599_v[p_6599_v]
            print p_6599_v+p_8336_v, p_6a19_50f9_v,
            for p_7cd6_v in p_7cd6_91cf_v:
                print p_7cd6_v,
            for p_51b0_v in p_51b0_91cf_v:
                print p_51b0_v,
            print ''

if __name__=="__main__":
    p_98f2_6599_55ae_751f_6210_5668_v()